.. _nie_userguide:

NIE Strings
============

Introduction
------------

The function :func:`clean_es_nie() <dataprep.clean.clean_es_nie.clean_es_nie>` cleans a column containing Spanish foreigner identity code (NIE) strings, and standardizes them in a given format. The function :func:`validate_es_nie() <dataprep.clean.clean_es_nie.validate_es_nie>` validates either a single NIE strings, a column of NIE strings or a DataFrame of NIE strings, returning `True` if the value is valid, and `False` otherwise.

NIE strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "X2482300W"
* `standard`: NIE strings with proper whitespace in the proper places. Note that in the case of NIE, the compact format is the same as the standard one.

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_es_nie()` and `validate_es_nie()`.

### An example dataset containing NIE strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "nie": [
            'x-2482300w',
            'x-2482300a',
            'BE 428759497',
            'BE431150351',
            "002 724 334",
            "hello",
            np.nan,
            "NULL",
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "1111 S Figueroa St, Los Angeles, CA 90015",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

            nie                                           address
0    x-2482300w                                     123 Pine Ave.
1    x-2482300a                                           main st
2  BE 428759497                      1234 west main heights 57033
3   BE431150351                    apt 1 789 s maple rd manhattan
4   002 724 334                robie house, 789 north main street
5         hello         1111 S Figueroa St, Los Angeles, CA 90015
6           NaN  (staples center) 1111 S Figueroa St, Los Angeles
7          NULL                                             hello

## 1. Default `clean_es_nie`

By default, `clean_es_nie` will clean nie strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_es_nie
clean_es_nie(df, column = "nie")

            nie                                           address  nie_clean
0    x-2482300w                                     123 Pine Ave.  X2482300W
1    x-2482300a                                           main st        NaN
2  BE 428759497                      1234 west main heights 57033        NaN
3   BE431150351                    apt 1 789 s maple rd manhattan        NaN
4   002 724 334                robie house, 789 north main street        NaN
5         hello         1111 S Figueroa St, Los Angeles, CA 90015        NaN
6           NaN  (staples center) 1111 S Figueroa St, Los Angeles        NaN
7          NULL                                             hello        NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_es_nie(df, column = "nie", output_format="standard")

            nie                                           address  nie_clean
0    x-2482300w                                     123 Pine Ave.  X2482300W
1    x-2482300a                                           main st        NaN
2  BE 428759497                      1234 west main heights 57033        NaN
3   BE431150351                    apt 1 789 s maple rd manhattan        NaN
4   002 724 334                robie house, 789 north main street        NaN
5         hello         1111 S Figueroa St, Los Angeles, CA 90015        NaN
6           NaN  (staples center) 1111 S Figueroa St, Los Angeles        NaN
7          NULL                                             hello        NaN

### `compact`

In [4]:
clean_es_nie(df, column = "nie", output_format="compact")

            nie                                           address  nie_clean
0    x-2482300w                                     123 Pine Ave.  X2482300W
1    x-2482300a                                           main st        NaN
2  BE 428759497                      1234 west main heights 57033        NaN
3   BE431150351                    apt 1 789 s maple rd manhattan        NaN
4   002 724 334                robie house, 789 north main street        NaN
5         hello         1111 S Figueroa St, Los Angeles, CA 90015        NaN
6           NaN  (staples center) 1111 S Figueroa St, Los Angeles        NaN
7          NULL                                             hello        NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned NIE strings is added with a title in the format `"{original title}_clean"`.

In [5]:
clean_es_nie(df, column="nie", inplace=True)

   nie_clean                                           address
0  X2482300W                                     123 Pine Ave.
1        NaN                                           main st
2        NaN                      1234 west main heights 57033
3        NaN                    apt 1 789 s maple rd manhattan
4        NaN                robie house, 789 north main street
5        NaN         1111 S Figueroa St, Los Angeles, CA 90015
6        NaN  (staples center) 1111 S Figueroa St, Los Angeles
7        NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [6]:
clean_es_nie(df, "nie", errors="coerce")

            nie                                           address  nie_clean
0    x-2482300w                                     123 Pine Ave.  X2482300W
1    x-2482300a                                           main st        NaN
2  BE 428759497                      1234 west main heights 57033        NaN
3   BE431150351                    apt 1 789 s maple rd manhattan        NaN
4   002 724 334                robie house, 789 north main street        NaN
5         hello         1111 S Figueroa St, Los Angeles, CA 90015        NaN
6           NaN  (staples center) 1111 S Figueroa St, Los Angeles        NaN
7          NULL                                             hello        NaN

### `ignore`

In [7]:
clean_es_nie(df, "nie", errors="ignore")

,nie,address,nie_clean
0,x-2482300w,123 Pine Ave.,X2482300W
1,x-2482300a,main st,x-2482300a
2,BE 428759497,1234 west main heights 57033,BE 428759497
3,BE431150351,apt 1 789 s maple rd manhattan,BE431150351
4,002 724 334,"robie house, 789 north main street",002 724 334
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",hello
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

## 4. `validate_es_nie()`

`validate_es_nie()` returns `True` when the input is a valid NIE. Otherwise it returns `False`.

The input of `validate_es_nie()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_es_nie()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_es_nie()` returns the validation result for the whole DataFrame.

In [8]:
from dataprep.clean import validate_es_nie
print(validate_es_nie("x-2482300w"))
print(validate_es_nie("x-2482300a"))
print(validate_es_nie('BE 428759497'))
print(validate_es_nie('BE431150351'))
print(validate_es_nie("004085616"))
print(validate_es_nie("hello"))
print(validate_es_nie(np.nan))
print(validate_es_nie("NULL"))

True
False
False
False
False
False
False
False

### Series

In [9]:
validate_es_nie(df["nie"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: nie, dtype: bool

### DataFrame + Specify Column

In [10]:
validate_es_nie(df, column="nie")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: nie, dtype: bool

### Only DataFrame

In [11]:
validate_es_nie(df)

     nie  address
0   True    False
1  False    False
2  False    False
3  False    False
4  False    False
5  False    False
6  False    False
7  False    False